	IDENTIFICATION DIVISION
	PROGRAM-ID. prog-001.
	AUTHOR. Geraldo Jr.
	DATE-WRITTEN. 12/05/2021.
        
	PROCEDURE DIVISION.
		DISPLAY "Hello, world - gnuCOBOL".
		STOP RUN.
